{"description":"Anticipates long-term business requirements, influences improvement of organisational process efficiency and effectiveness. Determines the Information Services (IS) model and the enterprise architecture in line with the organisation\u0027s policy and ensures a secure environment. Makes strategic Information Services (IS) policy decisions for the enterprise, including sourcing strategies.","group":"A - Plan","title":"Information Services (IS) and Business Strategy Alignment","code":"A.1.","levels":{"4":"Provides leadership for the construction and implementation of long term innovative Information Services (IS) solutions.","5":"Provides Information Services (IS) strategic leadership to reach consensus and commitment from the management team of the enterprise."},"knowledges":{"K1":"business strategy concepts","K2":"trends and implications of Information and Communications Technologies (ICT) internal or external developments for typical organisations","K3":"the potential and opportunities of relevant business models","K4":"the business aims and organisational objectives","K5":"the issues and implications of sourcing models","K6":"the new emerging technologies (e.g.distributed systems, virtualisation, mobility, data sets)","K7":"architectural frameworks","K8":"security"},"skills":{"S3":"identify and analyse long term user/customer needs","S4":"contribute to the development of Information and Communications Technologies (ICT) strategy and policy, including Information and Communications Technologies (ICT) security and quality","S5":"contribute to the development of the business strategy","S11":"understand the legal \u0026 regulatory landscape in order to factor into business requirements","S6":"analyse feasibility in terms of costs and benefits","S10":"understand the enterprise architecture","S7":"review and analyse effects of implementations","S8":"understand the impact of new technologies on business (e.g. open/big data, dematerialisation opportunities and strategies)","S9":"understand the business benefits of new technologies and how this can add value and provide competitive advantage (e.g. open/big data, dematerialisation opportunities and strategies)","S1":"analyse future developments in business process and technology application","S2":"determine requirements for processes related to Information and Communications Technologies (ICT) services"},"related":{}}