{"description":"Specifies, refines, updates and makes available a formal approach to implement solutions, necessary to develop and operate the Information Services (IS) architecture. Identifies change requirements and the components involved: hardware, software, applications, processes, information and technology platform. Takes into account interoperability, scalability, usability and security. Maintains alignment between business evolution and technology developments.","group":"A - Plan","title":"Architecture Design","code":"A.5.","levels":{"3":"Exploits specialist knowledge to define relevant Information and Communications Technologies (ICT) technology and specifications to be deployed in the construction of multiple Information and Communications Technologies (ICT) projects, applications or infrastructure improvements.","4":"Acts with wide ranging accountability to define the strategy to implement Information and Communications Technologies (ICT) technology compliant with business need. Takes account of the current technology platform, obsolescent equipment and latest technological innovations.","5":"Provides Information and Communications Technologies (ICT) strategic leadership for implementing the enterprise strategy. Applies strategic thinking to discover and recognize new patterns in vast datasets and new Information and Communications Technologies (ICT) systems, to achieve business savings."},"knowledges":{"K1":"architecture frameworks,methodologies and systems design tools","K2":"systems architecture requirements: performance, maintainability, extendibility, scalability, availability, security and accessibility","K3":"costs, benefits and risks of a system architecture","K4":"the company\u0027s enterprise architecture and internal standards","K5":"new emerging technologies (e.g., distributed systems, virtualisation models, datasets, mobile systems)"},"skills":{"S3":"understand the business objectives/drivers that impact the architecture component (data, application, security, development etc)","S4":"assist in communication of the enterprise architecture and standards, principles and objectives to the application teams","S5":"develop design patterns and models to assist system analysts in designing consistent applications","S1":"provide expertise to help solve complex technical problems and ensures best architecture solutions are implemented","S2":"use knowledge in various technology areas to build and deliver the enterprise architecture"},"related":{}}