{"description":"Analyses, specifies, updates and makes available a model to implement applications in accordance with Information Services (IS) policy and user/customer needs. Selects appropriate technical options for application design, optimising the balance between cost and quality. Designs data structures and builds system structure models according to analysis results through modeling languages. Ensures that all aspects take account of interoperability, usability and security. Identifies a common reference framework to validate the models with representative users, based upon development models (e.g. iterative approach).","group":"A - Plan","title":"Application Design","code":"A.6.","levels":{"1":"Contributes to the design and general functional specification and interfaces.","2":"Organises the overall planning of the design of the application.","3":"Accounts for own and others actions in ensuring that the application is correctly integrated within a complex environment and complies with user/customer needs."},"knowledges":{"K1":"requirements modelling and need analysis techniques","K2":"software developments methods and their rationale (e.g. prototyping, agile methods, reverse engineering, etc.)","K3":"metrics related to application development","K4":"user interface design principles","K5":"languages for formalising functional specification","K6":"existing applications and related architecture","K7":"Database Management System (DBMS), Data Warehouse, DSS... etc","K8":"mobile technologies","K9":"threat modelling techniques"},"skills":{"S3":"apply estimation models and data to evaluate costs of different software lifecycle phases","S4":"evaluate the use of prototypes to support requirements validation","S5":"design, organise and monitor the overall plan for the design of application","S6":"design functional specification starting from defined requirements","S7":"evaluate the suitability of different application development methods for the current scenario","S8":"establish systematic and frequent communication with customers, users and stakeholders","S9":"ensure that controls \u0026 functionality are built in to the design","S1":"identify customers, users and stakeholders","S2":"collect, formalise and validate functional and no-functional requirements"},"related":{}}