{"description":"Interprets the application design to develop a suitable application in accordance with customer needs. Adapts existing solutions by e.g. porting an application to another operating system. Codes, debugs, tests and documents and communicates product development stages. Selects appropriate technical options for development such as reusing, improving or reconfiguration of existing components. Optimises efficiency, cost and quality. Validates results with user representatives, integrates and commissions the overall solution.","group":"B - Build","title":"Application Development","code":"B.1.","levels":{"1":"Acts under guidance to develop, test and document applications.","2":"Systematically develops and validates applications.","3":"Acts creatively to develop applications and to select appropriate technical options. Accounts for others development activities. Optimizes application development, maintenance and performance by employing design patterns and by reusing proved solutions."},"knowledges":{"K1":"appropriate software programs/ modules","K2":"hardware components, tools and hardware architectures","K3":"functional and technical designing","K4":"state of the art technologies","K5":"programming languages","K11":"Intellectual Property Rights (IPR) issues","K6":"power consumption models of software and/or hardware","K10":"rapid application development (RAD)","K7":"Database Management System (DBMS)","K13":"interface definition languages (IDL)","K8":"operating systems and software platforms","K12":"modelling technology and languages","K9":"integrated development environment (IDE)","K14":"security"},"skills":{"S3":"apply appropriate software and/or hardware architectures","S4":"develop user interfaces, business software components and embedded software components","S5":"manage and guarantee high levels of cohesion and quality","S6":"use data models","S7":"perform and evaluate test in the customer or target environment","S8":"cooperate with development team and with application designers","S1":"explain and communicate the design/development to the customer","S2":"perform and evaluate test results against product specifications"},"related":{}}