{"description":"Constructs and executes systematic test procedures for Information and Communications Technologies (ICT) systems or customer usability requirements to establish compliance with design specifications. Ensures that new or revised components or systems perform to expectation. Ensures meeting of internal, external, national and international standards; including health and safety, usability, performance, reliability or compatibility. Produces documents and reports to evidence certification requirements.","group":"B - Build","title":"Testing","code":"B.3.","levels":{"1":"Performs simple tests in strict compliance with detailed instructions.","2":"Organises test programmes and builds scripts to stress test potential vulnerabilities. Records and reports outcomes providing analysis of results.","3":"Exploits specialist knowledge to supervise complex testing programmes. Ensures tests and results are documented to provide input to subsequent process owners such as designers, users or maintainers. Accountable for compliance with testing procedures including a documented audit trail.","4":"Exploits wide ranging specialist knowledge to create a process for the entire testing activity, including the establishment of internal standard of practices. Provides expert guidance and advice to the testing team."},"knowledges":{"K1":"techniques, infrastructure and tools to be used in the testing process","K2":"the lifecycle of a testing process","K3":"the different sorts of tests (functional, integration, performance, usability, stress etc.)","K4":"national and international standards defining quality criteria for testing","K5":"web, cloud and mobile technologies and environmental requirements"},"skills":{"S3":"design tests of Information and Communications Technologies (ICT) systems","S4":"prepare and conduct tests of Information and Communications Technologies (ICT) systems","S5":"report and document tests and results","S1":"create and manage a test plan","S2":"manage and evaluate the test process"},"related":{}}