{"description":"Applies a consistent procurement procedure, including deployment of the following sub processes: specification requirements, supplier identification, proposal analysis, evaluation of the energy efficiency and environmental compliance of products, suppliers and their processes, contract negotiation, supplier selection and contract placement. Ensures that the entire purchasing process is fit for purpose, adds business value to the organisation compliant to legal and regulatory requirements.","group":"D - Enable","title":"Purchasing","code":"D.4.","levels":{"2":"Understands and applies the principles of the procurement process; places orders based on existing supplier contracts. Ensures the correct execution of orders, including validation of deliverables and correlation with subsequent payments.","3":"Exploits specialist knowledge to deploy the purchasing process, ensuring positive commercial relationships with suppliers. Selects suppliers, products and services by evaluating performance, cost, timeliness and quality. Decides contract placement and complies with organisational policies.","4":"Provides leadership for the application of the organisation\u0027s procurement policies and makes recommendations for process enhancement. Applies experience and procurement practice expertise to make ultimate purchasing decisions."},"knowledges":{"K1":"typical purchase contract terms and conditions","K2":"own organisation purchasing policies","K3":"financial models e.g. discount structures","K4":"the current market for relevant products or services","K5":"the issues and implications of outsourcing services","K6":"different service models (Software as a Service SaaS, Platform-as-a-Service PaaS, Infrastructure as a Service IaaS) and operational translations (e.g. Cloud Computing)"},"skills":{"S3":"analyse received proposals/ offers","S4":"manage the purchasing budget","S5":"lead purchase process improvement","S6":"analyse the energy efficiency and environmental-related aspects of a proposal","S7":"verify that purchasing processes respect legal issues including Intellectual Property Rights (IPR)","S1":"interpret product/service specifications","S2":"negotiate terms, conditions and pricing"},"related":{}}